sisext-sapi-services/src/main/resources/soap/schemas/templates/soap-promocionesLogicWS.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:prom="http://www.etb.com.co/promociones-y-descuentos">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:Action>http://www.etb.com.co/promociones-y-descuentos/IPromocionesLogicService/PROM_Promociones_Activo</wsa:Action>
   </soap:Header>
   <soap:Body>
      <prom:PROM_Promociones_Activo>
         <prom:WSRequestHeader>
            <prom:property>
               <prom:Property>
                  <prom:name></prom:name>
                  <prom:value></prom:value>
               </prom:Property>
            </prom:property>
            <prom:system>
               <prom:correlationId>#[correlationId]</prom:correlationId>
               <prom:name></prom:name>
               <prom:processingServer></prom:processingServer>
            </prom:system>
         </prom:WSRequestHeader>
         <prom:WsRequestBody>
            <prom:IntegrationId>#[vars.integrationId]</prom:IntegrationId>
         </prom:WsRequestBody>
      </prom:PROM_Promociones_Activo>
   </soap:Body>
</soap:Envelope>